/*
 ********************************************************************************************
 *
 *	TPMS ECU
 *
 ********************************************************************************************
 */
/** @file	maintenance.h
 *	ファイルの概要を記述する
 *
 *	ファイルの詳細を記述する
 *
 *
 *
 *
 *
 *
 *
 ********************************************************************************************
 */

#ifndef	___MAINTENANCE_H___
#define	___MAINTENANCE_H___

extern void MaintenanceInit(void );/* デバッグ用のキー入力による処理の初期化処理 */
extern void MaintenanceSrv(void);/* デバッグ用のキー入力処理 */
extern void DebugPrint(char *str1, char *str2, int mask);/* デバッグ用の表示処理 */

#endif	/* ___MAINTENANCE_H___ */
